[
  {
    "title": "Company Overview and Services",
    "content": "Five Star Gulf Rentals is a premier vacation rental company serving Destin, Miramar Beach, and 30A, Florida. We specialize in luxury beachfront properties, condos, and vacation homes along the beautiful Emerald Coast. Our properties range from cozy 1-bedroom condos to expansive 8-bedroom beach houses. We offer both short-term vacation rentals and property management services. Our team is dedicated to providing memorable vacation experiences with personalized service, 24/7 guest support, and meticulously maintained properties. Contact us at (800) 208-2324 or reservations@fivestargulfrentals.com.",
    "metadata": {
      "category": "general_info",
      "tags": ["about", "company", "services", "contact"]
    }
  },
  {
    "title": "Booking Process and Availability",
    "content": "To book a property with Five Star Gulf Rentals, you can browse our website at www.fivestargulfrentals.com and use our search filters to find properties matching your needs (dates, number of bedrooms, amenities, location). You can check real-time availability and see pricing for your specific dates. To reserve, you can book directly online or call our reservations team at (800) 208-2324. We require a deposit at booking (typically 50% of the total) with the balance due 30 days prior to arrival. We accept all major credit cards. For peak season (June-August and holidays), we recommend booking 6-12 months in advance. Last-minute bookings are often available with special discounts.",
    "metadata": {
      "category": "booking",
      "tags": ["reservation", "availability", "payment", "deposit"]
    }
  },
  {
    "title": "Check-In and Check-Out Procedures",
    "content": "Check-in time is 4:00 PM and check-out time is 10:00 AM. We offer keyless entry - you'll receive detailed arrival instructions via email 3 days before check-in, including door codes and WiFi passwords. Early check-in and late check-out may be available upon request (additional fees may apply - contact us to inquire). Upon arrival, please conduct a brief property inspection and report any issues within 24 hours. We provide a welcome packet with property information, local restaurant recommendations, and emergency contacts. On departure, please leave keys/remotes, lock all doors and windows, turn off lights and thermostats, and dispose of trash in provided bins.",
    "metadata": {
      "category": "arrival_departure",
      "tags": ["check-in", "check-out", "arrival", "departure", "keyless-entry"]
    }
  },
  {
    "title": "Pet Policy",
    "content": "We offer many pet-friendly properties! Properties allowing pets are clearly marked on our website. Pet fees typically range from $150-$300 per stay, depending on the property and length of stay. We allow up to 2 pets per property (some properties allow more - check specific listing). Pets must be house-trained, up-to-date on vaccinations, and well-behaved. Please clean up after your pets both indoors and outdoors. Pets should not be left unattended in the property. Service animals are welcome at all properties at no additional charge (proper documentation required). Contact us at reservations@fivestargulfrentals.com with any questions about our pet policy.",
    "metadata": {
      "category": "policies",
      "tags": ["pets", "pet-friendly", "animals", "dogs", "cats"]
    }
  },
  {
    "title": "Amenities and Property Features",
    "content": "Our properties feature a wide range of amenities to enhance your stay. Common amenities include: fully equipped kitchens with modern appliances, linens and towels provided, high-speed WiFi, flat-screen TVs with cable/streaming, washer and dryer, central air conditioning and heating. Many properties offer: private pools, gulf-front balconies, beach access, BBQ grills, outdoor dining areas, game rooms, garage parking. Beachfront properties include beach chairs and umbrellas (seasonal). All properties are professionally cleaned before each arrival. Beach towels, starter supplies (toilet paper, paper towels, dish soap, trash bags), and basic toiletries are provided. Full kitchens include cookware, dishes, glassware, and utensils.",
    "metadata": {
      "category": "amenities",
      "tags": ["features", "kitchen", "pool", "beach-access", "wifi", "parking"]
    }
  },
  {
    "title": "Cancellation and Refund Policy",
    "content": "Our standard cancellation policy: Full refund if cancelled 60+ days before arrival. 50% refund if cancelled 30-59 days before arrival. No refund if cancelled less than 30 days before arrival. During peak season (June-August), stricter policies may apply - check your booking confirmation. Travel insurance is highly recommended and can be purchased at time of booking. We offer trip protection insurance through CSA Travel Protection or Red Sky. In case of hurricane evacuation orders, we offer flexible rescheduling options. For questions about specific bookings, contact our reservations team at (800) 208-2324 or reservations@fivestargulfrentals.com.",
    "metadata": {
      "category": "policies",
      "tags": ["cancellation", "refund", "insurance", "hurricane"]
    }
  },
  {
    "title": "Destin and 30A Area Information",
    "content": "Destin and 30A are located on Florida's Emerald Coast, known for pristine white sand beaches and crystal-clear turquoise waters. Top attractions include: Henderson Beach State Park, Big Kahuna's Water Park, Destin Harbor Boardwalk, Gulf Islands National Seashore, Grayton Beach State Park, and Seaside (charming beach town featured in The Truman Show). Popular activities: deep-sea fishing, dolphin cruises, parasailing, paddleboarding, kayaking, snorkeling, beach bonfires, golf at championship courses. Dining: over 200 restaurants ranging from casual beachside cafes to upscale seafood. Shopping: Silver Sands Premium Outlets, Grand Boulevard Town Center, local art galleries. Best time to visit: April-May and September-October for great weather and fewer crowds.",
    "metadata": {
      "category": "local_info",
      "tags": ["destin", "30a", "attractions", "activities", "beaches", "restaurants"]
    }
  },
  {
    "title": "Guest Responsibilities and House Rules",
    "content": "To ensure a pleasant stay for all guests, please follow these house rules: Maximum occupancy limits must be observed (varies by property). Quiet hours are 10:00 PM to 8:00 AM - please respect neighbors. No parties or events without prior approval. No smoking inside properties (some have designated outdoor smoking areas). Dispose of trash properly and frequently. Report any damages or maintenance issues immediately. Do not move furniture or remove items from the property. Beach equipment must be returned to property before check-out. Follow community HOA rules (parking, pool hours, beach access). Guests are financially responsible for damages beyond normal wear and tear. Violations may result in immediate eviction without refund. Contact us 24/7 with any questions or concerns at (800) 208-2324.",
    "metadata": {
      "category": "policies",
      "tags": ["rules", "responsibilities", "quiet-hours", "smoking", "damages"]
    }
  },
  {
    "title": "Maintenance and Emergency Support",
    "content": "We provide 24/7 guest support for maintenance issues and emergencies. For urgent issues (no AC, plumbing problems, lockouts), call our emergency line immediately: (800) 208-2324. For non-urgent requests (light bulb replacement, missing items), use our guest portal or email reservations@fivestargulfrentals.com. Our local maintenance team typically responds within 2 hours for emergencies and within 24 hours for non-urgent issues. In case of medical emergency, call 911. For severe weather updates and evacuation procedures, monitor local news and check your email for updates from our team. We have partnerships with local contractors, HVAC specialists, and electricians to ensure rapid response. Your comfort and safety are our top priorities.",
    "metadata": {
      "category": "support",
      "tags": ["maintenance", "emergency", "24-7", "support", "repairs"]
    }
  },
  {
    "title": "Parking and Transportation",
    "content": "Parking varies by property. Most properties include: 2-4 designated parking spaces (check specific listing), garage parking for select properties, additional parking in community lots (limited). Street parking may be restricted or prohibited - check local signage. RVs, boats, and trailers are typically not permitted without prior approval. Parking passes may be required for some condo complexes - we'll provide these with your check-in information. Local transportation options: Uber/Lyft readily available, beach shuttle services (seasonal), bike rentals from local shops, car rentals recommended for exploring the area. Popular spots within driving distance: Seaside (15 min), Rosemary Beach (20 min), Panama City Beach (35 min), Pensacola (60 min). Airport: Northwest Florida Beaches International (ECP) is 30 minutes away.",
    "metadata": {
      "category": "logistics",
      "tags": ["parking", "transportation", "driving", "airport", "car-rental"]
    }
  },
  {
    "title": "Beach Access and Equipment",
    "content": "Beach access varies by property location. Gulf-front properties: direct private beach access via stairs or walkways. Across-the-street properties: public beach access points within walking distance (typically 2-5 minute walk). Gated communities: private beach access for residents and guests. All properties include information about nearest beach access points. Beach equipment provided (seasonal March-October): 2 beach chairs per bedroom, 1 beach umbrella (varies by property). Additional beach gear available for rent: paddleboards, kayaks, beach cabanas, beach cruiser bikes. Beach safety: check flag warning system daily (green=calm, yellow=moderate, red=dangerous, double red=closed). Lifeguards on duty seasonally at main public beaches. Follow all posted signs and swim near lifeguard towers when possible.",
    "metadata": {
      "category": "beach",
      "tags": ["beach-access", "beach-chairs", "umbrellas", "equipment", "safety"]
    }
  },
  {
    "title": "Seasonal Information and Events",
    "content": "Peak Season (June-August): Busiest time with highest rates, perfect weather, all attractions open. Book 6-12 months ahead. Spring Break (March-April): Popular with families, moderate rates, beautiful weather. Book 4-6 months ahead. Shoulder Season (April-May, Sept-Oct): Best value, great weather, fewer crowds. Ideal for couples and retirees. Off-Season (Nov-Feb): Lowest rates, mild temperatures (60s-70s), perfect for snowbirds. Many still swim! Annual Events: Destin Seafood Festival (October), 30A Songwriters Festival (January), Sandestin Wine Festival (April), Memorial Day/4th of July fireworks, Thunder Beach Motorcycle Rally (multiple dates). Hurricane Season: June 1 - November 30. We monitor closely and provide evacuation assistance if needed. Travel insurance strongly recommended during this period.",
    "metadata": {
      "category": "travel_planning",
      "tags": ["seasons", "events", "weather", "festivals", "holidays"]
    }
  }
]
